cask_args appdir: '/Applications'

tap 'neovim/neovim'
tap 'caskroom/versions'

brew 'ack'
brew 'tmux'
brew 'axel'
brew 'tree'
brew 'wget'
brew 'imagemagick'
brew 'graphviz'
brew 'tig'
brew 'cowsay'
brew 'colordiff'
brew 'python3'
brew 'postgresql'
brew 'phantomjs'
brew 'terminal-notifier'
brew 'fish'
brew 'reattach-to-user-namespace'
brew 'go', args: [ "--devel" ] # Make hub work
brew 'hub'
brew 'fswatch'
brew 'neovim'

cask 'java'
cask 'google-chrome'
cask 'spotify'
cask 'omnifocus'
cask 'iTerm2'
cask 'divvy'
cask 'anaconda'
cask 'intellij-idea-ce'
cask 'alfred'

mas 'Airmail 3', id: 918858936
mas 'Dash 3', id: 449589707
mas 'Slack', id: 803453959
mas 'Marked 2', id: 890031187
mas 'Annotate', id: 918207447
