cask_args appdir: '/Applications'

tap 'neovim/neovim'
tap 'caskroom/versions'

brew 'ack'
brew 'tmux'
brew 'axel'
brew 'tree'
brew 'wget'
brew 'imagemagick'
brew 'graphviz'
brew 'tig'
brew 'cowsay'
brew 'colordiff'
brew 'python3'
brew 'postgresql'
brew 'phantomjs'
brew 'terminal-notifier'
brew 'fish'
brew 'reattach-to-user-namespace'
brew 'go', args: [ "--devel" ] # Make hub work
brew 'hub'
brew 'fswatch'
brew 'neovim'
brew 'rbenv'
brew 'rbenv-default-gems'
brew 'ruby-build'
brew 'fswatch'
brew 'jq'
brew 'erlang', args: ["--without-wxmac"]
brew 'elixir'
brew 'node'
brew 'heroku'

cask 'docker'
cask 'pocketcast'
cask 'google-drive'
cask 'logitech-gaming-software'
cask 'java'
cask 'google-chrome'
cask 'google-chrome-canary'
cask 'spotify'
cask 'omnifocus'
cask 'iTerm2'
cask 'divvy'
cask 'flux'
cask 'istat-menus'
cask 'anaconda'
cask 'intellij-idea-ce'
cask 'alfred'

mas 'Airmail 3', id: 918858936
mas 'Dash 3', id: 449589707
mas 'Slack', id: 803453959
mas 'Marked 2', id: 890031187
mas 'Annotate', id: 918207447
mas 'Pocket', id: 568494494
