cask_args appdir: '/Applications'

tap 'caskroom/drivers'
tap 'caskroom/versions'
tap 'homebrew/versions'
tap 'neovim/neovim'
tap 'tjanson/firefox-esr'
tap 'mscharley/homebrew'

brew 'ack'
brew 'mscharley/homebrew/alacritty', args: ['HEAD']
brew 'aspell'
brew 'axel'
brew 'certbot'
brew 'cheat'
brew 'colordiff'
brew 'cowsay'
brew 'elasticsearch'
brew 'elixir'
brew 'erlang', args: ["--without-wxmac"]
brew 'fish'
brew 'fswatch'
brew 'geckodriver'
brew 'git'
brew 'git-lfs'
brew 'go', args: [ "--devel" ] # Make hub work
brew 'graphviz'
brew 'heroku'
brew 'hub'
brew 'imagemagick'
brew 'jq'
brew 'libxml2'
brew 'libxslt'
brew 'neovim'
brew 'phantomjs'
brew 'postgresql94'
`brew link --force postgresql94`
brew 'python3'
brew 'qt'
brew 'rabbitmq'
brew 'rbenv'
brew 'rbenv-default-gems'
brew 'reattach-to-user-namespace'
brew 'redis'
brew 'ruby-build'
brew 'terminal-notifier'
brew 'tig'
brew 'tmux'
brew 'tree'
brew 'watchman'
brew 'wget'
brew 'yarn'

cask '1password'
cask 'alfred'
cask 'anaconda'
cask 'backblaze'
cask 'bartender'
cask 'dash'
cask 'docker'
cask 'dropbox'
cask 'elm-platform'
cask 'firefox-esr45'
cask 'fluid'
cask 'flux'
cask 'focus'
cask 'google-chrome'
cask 'google-chrome-canary'
cask 'google-drive'
cask 'grandperspective'
cask 'firefoxdeveloperedition'
cask 'iTerm2'
cask 'intellij-idea-ce'
cask 'istat-menus'
cask 'java'
cask 'keybase'
cask 'licecap'
cask 'logitech-gaming-software'
cask 'mattr-slate'
cask 'omnifocus'
cask 'pocketcasts'
cask 'postman'
cask 'resilio-sync'
cask 'screenhero'
cask 'selfcontrol'
cask 'skim'
cask 'soapui'
cask 'spotify'
cask 'teamviewer'
cask 'toggldesktop'
cask 'tunnelblick'
cask 'virtualbox'
cask 'workflowy'
cask 'slack'

mas 'Airmail 3', id: 918858936
mas 'Annotate', id: 918207447
mas 'Due — Reminders, Countdown Timers', id: 524373870
mas 'Marked 2', id: 890031187
mas 'Pocket', id: 568494494
mas 'Todoist: To Do List | Task List', id: 585829637
